# Languages
brew "elixir"
brew "elm"
brew "elm-format"
brew "erlang"
brew "go"
brew "python"
brew "rbenv"
brew "rbenv-default-gems"
brew "reattach-to-user-namespace"
brew "ruby-build"

# Productivity
brew "bash" # The default on macOS is old
brew "fish"
brew "fzf"
brew "git"
brew "htop"
brew "mercurial"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "zsh"

# Security
brew "gnupg"
brew "openssl"

# Apps
cask "alfred"
cask "dashlane"
cask "google-chrome"
cask "iterm2"
cask "postico"
cask "screenhero"
cask "slack"
cask "spotify"
cask "vlc"
cask "whatsapp"

# Dev stuff
cask "docker"
cask "java" # JDK
brew "libav" # For avconv
brew "postgresql"

# Carwow
brew "awscli"
brew "ansible"
cask "ccmenu"
brew "heroku"
brew "imagemagick@6"
brew "packer"
brew "phantomjs"
