# Provisioning/ops
brew "ansible"
brew "docker"
brew "docker-machine"
brew "docker-compose"
brew "hugo"

# Languages
brew "elixir"
brew "gcc"
brew "go"
brew "python"
brew "rbenv"
brew "rbenv-default-gems"
brew "reattach-to-user-namespace"
brew "ruby-build"

# Productivity
brew "fzf"
brew "git"
brew "mercurial"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "zsh"

# Security
brew "gnupg"
brew "gpg-agent"
brew "openssl"

# Storage
brew "postgresql"
brew "rabbitmq"
brew "sqlite"

# Cask
brew "caskroom/cask/brew-cask"

# Apps
cask "alfred"
cask "cloud" # CloudApp - drop files to share them 👌
cask "dashlane"
cask "iterm2"
cask "google-chrome"
cask "google-drive"
cask "slack"
cask "tunnelblick"
cask "vlc"

# Dev stuff
cask "java" # JDK
cask "osxfuse" # Mounting non-Mac filesystems (e.g. ext4)
cask "vagrant" # VMs
cask "virtualbox"
cask "virtualbox-extension-pack"
